---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
source: html/b9450b20-341b-b4fb-2e95-64cf0dc58d88.htm
---
# StructuralSectionGeneralR Methods

Returns size of the section boundary.